#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/naga-paritala/terraform-samples/runs/run-WgP8yr6W7rEJyHkf

Waiting for the plan to start...

Terraform v1.5.0
on linux_amd64
Initializing plugins and modules...
2023-06-20T20:09:17.702Z [INFO]  Terraform version: 1.5.0
2023-06-20T20:09:17.702Z [DEBUG] using github.com/hashicorp/go-tfe v1.26.0
2023-06-20T20:09:17.702Z [DEBUG] using github.com/hashicorp/hcl/v2 v2.16.2
2023-06-20T20:09:17.702Z [DEBUG] using github.com/hashicorp/terraform-svchost v0.1.0
2023-06-20T20:09:17.702Z [DEBUG] using github.com/zclconf/go-cty v1.12.2
2023-06-20T20:09:17.702Z [INFO]  Go runtime version: go1.20
2023-06-20T20:09:17.702Z [INFO]  CLI args: []string{"/home/tfc-agent/.tfc-agent/component/terraform/runs/run-WgP8yr6W7rEJyHkf/bin/terraform", "plan", "-out=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-WgP8yr6W7rEJyHkf/config/terraform.tfplan", "-var-file=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-WgP8yr6W7rEJyHkf/terraform.tfvars", "-detailed-exitcode", "-lock=false"}
2023-06-20T20:09:17.702Z [DEBUG] Attempting to open CLI config file: /home/tfc-agent/.tfc-agent/component/terraform/runs/run-WgP8yr6W7rEJyHkf/.terraformrc
2023-06-20T20:09:17.703Z [INFO]  Loading CLI configuration from /home/tfc-agent/.tfc-agent/component/terraform/runs/run-WgP8yr6W7rEJyHkf/.terraformrc
2023-06-20T20:09:17.703Z [DEBUG] checking for credentials in "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-WgP8yr6W7rEJyHkf/.terraform.d/plugins"
2023-06-20T20:09:17.703Z [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2023-06-20T20:09:17.703Z [DEBUG] will search for provider plugins in /home/tfc-agent/.tfc-agent/component/terraform/runs/run-WgP8yr6W7rEJyHkf/.terraform.d/plugins
2023-06-20T20:09:17.704Z [DEBUG] ignoring non-existing provider search directory /home/tfc-agent/.tfc-agent/component/terraform/runs/run-WgP8yr6W7rEJyHkf/.local/share/terraform/plugins
2023-06-20T20:09:17.704Z [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins
2023-06-20T20:09:17.704Z [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins
2023-06-20T20:09:17.705Z [INFO]  CLI command args: []string{"plan", "-out=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-WgP8yr6W7rEJyHkf/config/terraform.tfplan", "-var-file=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-WgP8yr6W7rEJyHkf/terraform.tfvars", "-detailed-exitcode", "-lock=false"}
2023-06-20T20:09:17.707Z [DEBUG] Service discovery for app.terraform.io at https://app.terraform.io/.well-known/terraform.json
2023-06-20T20:09:17.733Z [DEBUG] Service discovery for app.terraform.io aliased as localterraform.com
2023-06-20T20:09:18.955Z [DEBUG] checking for provisioner in "."
2023-06-20T20:09:18.956Z [DEBUG] checking for provisioner in "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-WgP8yr6W7rEJyHkf/bin"
2023-06-20T20:09:18.956Z [DEBUG] checking for provisioner in "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-WgP8yr6W7rEJyHkf/.terraform.d/plugins"
2023-06-20T20:09:19.035Z [INFO]  backend/local: starting Plan operation
2023-06-20T20:09:19.347Z [DEBUG] backend/local: Skipping interactive prompts for variables because input is disabled
2023-06-20T20:09:19.347Z [DEBUG] Building and walking validate graph
2023-06-20T20:09:19.348Z [DEBUG] ProviderTransformer: "module.ec2.aws_launch_configuration.launch_config" (*terraform.NodeValidatableResource) needs module.ec2.provider["registry.terraform.io/hashicorp/aws"]
2023-06-20T20:09:19.348Z [DEBUG] ProviderTransformer: "module.ec2.aws_autoscaling_group.autoscaling_group" (*terraform.NodeValidatableResource) needs module.ec2.provider["registry.terraform.io/hashicorp/aws"]
2023-06-20T20:09:19.348Z [DEBUG] ProviderTransformer: "module.ec2.aws_instance.ec2_instance" (*terraform.NodeValidatableResource) needs module.ec2.provider["registry.terraform.io/hashicorp/aws"]
2023-06-20T20:09:19.348Z [DEBUG] pruning unused provider["registry.terraform.io/hashicorp/null"]
2023-06-20T20:09:19.348Z [DEBUG] pruning unused provider["registry.terraform.io/hashicorp/aws"]
2023-06-20T20:09:19.348Z [DEBUG] pruning unused provider["registry.terraform.io/hashicorp/random"]
2023-06-20T20:09:19.348Z [DEBUG] created provider logger: level=debug
2023-06-20T20:09:19.349Z [INFO]  provider: configuring client automatic mTLS
2023-06-20T20:09:19.379Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5]
2023-06-20T20:09:19.382Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5 pid=64
2023-06-20T20:09:19.382Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5
2023-06-20T20:09:19.682Z [INFO]  provider.terraform-provider-aws_v5.4.0_x5: configuring server automatic mTLS: timestamp=2023-06-20T20:09:19.681Z
2023-06-20T20:09:19.700Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: plugin address: address=/tmp/plugin344692623 network=unix timestamp=2023-06-20T20:09:19.699Z
2023-06-20T20:09:19.700Z [DEBUG] provider: using plugin: version=5
2023-06-20T20:09:20.145Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-06-20T20:09:20.146Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5 pid=64
2023-06-20T20:09:20.146Z [DEBUG] provider: plugin exited
2023-06-20T20:09:20.146Z [DEBUG] ReferenceTransformer: "module.ec2.var.max_size (expand)" references: []
2023-06-20T20:09:20.146Z [DEBUG] ReferenceTransformer: "module.ec2.var.subnet_id (expand)" references: []
2023-06-20T20:09:20.146Z [DEBUG] ReferenceTransformer: "module.ec2 (close)" references: []
2023-06-20T20:09:20.146Z [DEBUG] ReferenceTransformer: "module.ec2.aws_launch_configuration.launch_config" references: [module.ec2.var.ami_id (expand) module.ec2.var.instance_type (expand)]
2023-06-20T20:09:20.147Z [DEBUG] ReferenceTransformer: "module.ec2.aws_autoscaling_group.autoscaling_group" references: [module.ec2.var.subnet_id (expand) module.ec2.aws_launch_configuration.launch_config module.ec2.var.desired_capacity (expand) module.ec2.var.max_size (expand) module.ec2.var.min_size (expand)]
2023-06-20T20:09:20.147Z [DEBUG] ReferenceTransformer: "module.ec2.var.ami_id (expand)" references: []
2023-06-20T20:09:20.147Z [DEBUG] ReferenceTransformer: "module.ec2.var.min_size (expand)" references: []
2023-06-20T20:09:20.147Z [DEBUG] ReferenceTransformer: "module.ec2.provider[\"registry.terraform.io/hashicorp/aws\"]" references: [module.ec2.var.aws_region (expand)]
2023-06-20T20:09:20.147Z [DEBUG] ReferenceTransformer: "module.ec2 (expand)" references: []
2023-06-20T20:09:20.147Z [DEBUG] ReferenceTransformer: "module.ec2.aws_instance.ec2_instance" references: [module.ec2.var.subnet_id (expand) module.ec2.var.ami_id (expand) module.ec2.var.instance_type (expand)]
2023-06-20T20:09:20.147Z [DEBUG] ReferenceTransformer: "module.ec2.var.desired_capacity (expand)" references: []
2023-06-20T20:09:20.147Z [DEBUG] ReferenceTransformer: "module.ec2.var.aws_region (expand)" references: []
2023-06-20T20:09:20.147Z [DEBUG] ReferenceTransformer: "module.ec2.var.instance_type (expand)" references: []
2023-06-20T20:09:20.148Z [DEBUG] Starting graph walk: walkValidate
2023-06-20T20:09:20.149Z [DEBUG] created provider logger: level=debug
2023-06-20T20:09:20.149Z [INFO]  provider: configuring client automatic mTLS
2023-06-20T20:09:20.161Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5]
2023-06-20T20:09:20.163Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5 pid=90
2023-06-20T20:09:20.163Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5
2023-06-20T20:09:20.468Z [INFO]  provider.terraform-provider-aws_v5.4.0_x5: configuring server automatic mTLS: timestamp=2023-06-20T20:09:20.468Z
2023-06-20T20:09:20.486Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: plugin address: network=unix address=/tmp/plugin3103384521 timestamp=2023-06-20T20:09:20.486Z
2023-06-20T20:09:20.487Z [DEBUG] provider: using plugin: version=5
2023-06-20T20:09:20.893Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 tf_rpc=PrepareProviderConfig tf_attribute_path=shared_config_files tf_mux_provider=*proto5server.Server @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 timestamp=2023-06-20T20:09:20.893Z
2023-06-20T20:09:20.893Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig tf_mux_provider=*proto5server.Server @module=sdk.framework tf_attribute_path=shared_config_files tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 timestamp=2023-06-20T20:09:20.893Z
2023-06-20T20:09:20.893Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: @module=sdk.framework tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 tf_attribute_path=shared_credentials_files timestamp=2023-06-20T20:09:20.893Z
2023-06-20T20:09:20.893Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 @module=sdk.framework tf_attribute_path=shared_credentials_files tf_mux_provider=*proto5server.Server timestamp=2023-06-20T20:09:20.893Z
2023-06-20T20:09:20.894Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 tf_mux_provider=*proto5server.Server tf_rpc=PrepareProviderConfig @module=sdk.framework tf_attribute_path=max_retries tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2023-06-20T20:09:20.893Z
2023-06-20T20:09:20.894Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 tf_mux_provider=*proto5server.Server @module=sdk.framework tf_attribute_path=max_retries tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 timestamp=2023-06-20T20:09:20.893Z
2023-06-20T20:09:20.894Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: tf_attribute_path=allowed_account_ids tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 @module=sdk.framework tf_mux_provider=*proto5server.Server tf_rpc=PrepareProviderConfig timestamp=2023-06-20T20:09:20.894Z
2023-06-20T20:09:20.894Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: tf_rpc=PrepareProviderConfig @module=sdk.framework tf_attribute_path=allowed_account_ids tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 timestamp=2023-06-20T20:09:20.894Z
2023-06-20T20:09:20.894Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: @module=sdk.framework tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 tf_attribute_path=forbidden_account_ids tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2023-06-20T20:09:20.894Z
2023-06-20T20:09:20.894Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: @module=sdk.framework tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 tf_attribute_path=forbidden_account_ids timestamp=2023-06-20T20:09:20.894Z
2023-06-20T20:09:20.894Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: @module=sdk.framework tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2023-06-20T20:09:20.894Z
2023-06-20T20:09:20.894Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig tf_mux_provider=*proto5server.Server tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 timestamp=2023-06-20T20:09:20.894Z
2023-06-20T20:09:20.894Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined validator.List: description="list must contain at most 1 elements" tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:217 @module=sdk.framework tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 timestamp=2023-06-20T20:09:20.894Z
2023-06-20T20:09:20.894Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined validator.List: tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:227 tf_mux_provider=*proto5server.Server @module=sdk.framework description="list must contain at most 1 elements" timestamp=2023-06-20T20:09:20.894Z
2023-06-20T20:09:20.894Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/aws @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 tf_mux_provider=*proto5server.Server tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 tf_rpc=PrepareProviderConfig timestamp=2023-06-20T20:09:20.894Z
2023-06-20T20:09:20.894Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: tf_provider_addr=registry.terraform.io/hashicorp/aws @module=sdk.framework tf_mux_provider=*proto5server.Server tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 timestamp=2023-06-20T20:09:20.894Z
2023-06-20T20:09:20.894Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined validator.List: @module=sdk.framework tf_mux_provider=*proto5server.Server tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:217 description="list must contain at most 1 elements" tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig timestamp=2023-06-20T20:09:20.894Z
2023-06-20T20:09:20.894Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined validator.List: tf_mux_provider=*proto5server.Server description="list must contain at most 1 elements" @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:227 timestamp=2023-06-20T20:09:20.894Z
2023-06-20T20:09:20.894Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws @module=sdk.framework tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 tf_rpc=PrepareProviderConfig timestamp=2023-06-20T20:09:20.894Z
2023-06-20T20:09:20.894Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 @module=sdk.framework tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 tf_rpc=PrepareProviderConfig timestamp=2023-06-20T20:09:20.894Z
2023-06-20T20:09:20.895Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 @module=sdk.framework tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 timestamp=2023-06-20T20:09:20.895Z
2023-06-20T20:09:20.895Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 @module=sdk.framework tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig timestamp=2023-06-20T20:09:20.895Z
2023-06-20T20:09:20.895Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined validator.List: description="list must contain at most 1 elements" tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig @module=sdk.framework tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:217 tf_mux_provider=*proto5server.Server timestamp=2023-06-20T20:09:20.895Z
2023-06-20T20:09:20.895Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined validator.List: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:227 description="list must contain at most 1 elements" tf_mux_provider=*proto5server.Server tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig timestamp=2023-06-20T20:09:20.895Z
2023-06-20T20:09:20.895Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: @module=sdk.framework tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig timestamp=2023-06-20T20:09:20.895Z
2023-06-20T20:09:20.895Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: tf_provider_addr=registry.terraform.io/hashicorp/aws @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 tf_mux_provider=*proto5server.Server tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 tf_rpc=PrepareProviderConfig @module=sdk.framework timestamp=2023-06-20T20:09:20.895Z
2023-06-20T20:09:20.895Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined validator.List: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:217 @module=sdk.framework tf_rpc=PrepareProviderConfig description="list must contain at most 1 elements" tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 timestamp=2023-06-20T20:09:20.895Z
2023-06-20T20:09:20.895Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined validator.List: tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4a8eee55-c2f6-8e24-fa10-dc1740458b47 tf_rpc=PrepareProviderConfig @module=sdk.framework description="list must contain at most 1 elements" tf_mux_provider=*proto5server.Server @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:227 timestamp=2023-06-20T20:09:20.895Z
2023-06-20T20:09:20.902Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-06-20T20:09:20.903Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5 pid=90
2023-06-20T20:09:20.903Z [DEBUG] provider: plugin exited
2023-06-20T20:09:20.903Z [INFO]  backend/local: plan calling Plan
2023-06-20T20:09:20.903Z [DEBUG] Building and walking plan graph for NormalMode
2023-06-20T20:09:20.904Z [DEBUG] ProviderTransformer: "module.ec2.aws_instance.ec2_instance (expand)" (*terraform.nodeExpandPlannableResource) needs module.ec2.provider["registry.terraform.io/hashicorp/aws"]
2023-06-20T20:09:20.904Z [DEBUG] ProviderTransformer: "module.ec2.aws_autoscaling_group.autoscaling_group (expand)" (*terraform.nodeExpandPlannableResource) needs module.ec2.provider["registry.terraform.io/hashicorp/aws"]
2023-06-20T20:09:20.904Z [DEBUG] ProviderTransformer: "module.ec2.aws_launch_configuration.launch_config (expand)" (*terraform.nodeExpandPlannableResource) needs module.ec2.provider["registry.terraform.io/hashicorp/aws"]
2023-06-20T20:09:20.904Z [DEBUG] pruning unused provider["registry.terraform.io/hashicorp/null"]
2023-06-20T20:09:20.904Z [DEBUG] pruning unused provider["registry.terraform.io/hashicorp/random"]
2023-06-20T20:09:20.904Z [DEBUG] pruning unused provider["registry.terraform.io/hashicorp/aws"]
2023-06-20T20:09:20.904Z [DEBUG] ReferenceTransformer: "module.ec2.var.desired_capacity (expand)" references: []
2023-06-20T20:09:20.904Z [DEBUG] ReferenceTransformer: "module.ec2.var.aws_region (expand)" references: []
2023-06-20T20:09:20.904Z [DEBUG] ReferenceTransformer: "module.ec2 (expand)" references: []
2023-06-20T20:09:20.904Z [DEBUG] ReferenceTransformer: "module.ec2.provider[\"registry.terraform.io/hashicorp/aws\"]" references: [module.ec2.var.aws_region (expand)]
2023-06-20T20:09:20.905Z [DEBUG] ReferenceTransformer: "module.ec2.aws_instance.ec2_instance (expand)" references: [module.ec2.var.subnet_id (expand) module.ec2.var.ami_id (expand) module.ec2.var.instance_type (expand)]
2023-06-20T20:09:20.905Z [DEBUG] ReferenceTransformer: "module.ec2.var.subnet_id (expand)" references: []
2023-06-20T20:09:20.905Z [DEBUG] ReferenceTransformer: "module.ec2.var.max_size (expand)" references: []
2023-06-20T20:09:20.905Z [DEBUG] ReferenceTransformer: "module.ec2.aws_autoscaling_group.autoscaling_group (expand)" references: [module.ec2.var.subnet_id (expand) module.ec2.var.desired_capacity (expand) module.ec2.aws_launch_configuration.launch_config (expand) module.ec2.var.max_size (expand) module.ec2.var.min_size (expand)]
2023-06-20T20:09:20.905Z [DEBUG] ReferenceTransformer: "module.ec2.aws_launch_configuration.launch_config (expand)" references: [module.ec2.var.instance_type (expand) module.ec2.var.ami_id (expand)]
2023-06-20T20:09:20.905Z [DEBUG] ReferenceTransformer: "module.ec2.var.min_size (expand)" references: []
2023-06-20T20:09:20.905Z [DEBUG] ReferenceTransformer: "module.ec2.var.ami_id (expand)" references: []
2023-06-20T20:09:20.905Z [DEBUG] ReferenceTransformer: "module.ec2.var.instance_type (expand)" references: []
2023-06-20T20:09:20.905Z [DEBUG] ReferenceTransformer: "module.ec2 (close)" references: []
2023-06-20T20:09:20.906Z [DEBUG] Starting graph walk: walkPlan
2023-06-20T20:09:20.907Z [DEBUG] created provider logger: level=debug
2023-06-20T20:09:20.907Z [INFO]  provider: configuring client automatic mTLS
2023-06-20T20:09:20.919Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5]
2023-06-20T20:09:20.922Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5 pid=108
2023-06-20T20:09:20.922Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5
2023-06-20T20:09:21.209Z [INFO]  provider.terraform-provider-aws_v5.4.0_x5: configuring server automatic mTLS: timestamp=2023-06-20T20:09:21.209Z
2023-06-20T20:09:21.228Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: plugin address: address=/tmp/plugin1288786901 network=unix timestamp=2023-06-20T20:09:21.227Z
2023-06-20T20:09:21.228Z [DEBUG] provider: using plugin: version=5
2023-06-20T20:09:21.575Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 tf_rpc=PrepareProviderConfig @module=sdk.framework tf_attribute_path=shared_config_files tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 timestamp=2023-06-20T20:09:21.575Z
2023-06-20T20:09:21.575Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 tf_attribute_path=shared_config_files tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 @module=sdk.framework tf_mux_provider=*proto5server.Server tf_rpc=PrepareProviderConfig timestamp=2023-06-20T20:09:21.575Z
2023-06-20T20:09:21.576Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: tf_attribute_path=allowed_account_ids tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 @module=sdk.framework tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig timestamp=2023-06-20T20:09:21.575Z
2023-06-20T20:09:21.576Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 @module=sdk.framework tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 tf_attribute_path=allowed_account_ids timestamp=2023-06-20T20:09:21.575Z
2023-06-20T20:09:21.576Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 @module=sdk.framework tf_attribute_path=shared_credentials_files tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig timestamp=2023-06-20T20:09:21.576Z
2023-06-20T20:09:21.576Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 tf_attribute_path=shared_credentials_files tf_mux_provider=*proto5server.Server tf_rpc=PrepareProviderConfig timestamp=2023-06-20T20:09:21.576Z
2023-06-20T20:09:21.576Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: @module=sdk.framework tf_attribute_path=max_retries tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 tf_mux_provider=*proto5server.Server timestamp=2023-06-20T20:09:21.576Z
2023-06-20T20:09:21.576Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 @module=sdk.framework tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_attribute_path=max_retries tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 timestamp=2023-06-20T20:09:21.576Z
2023-06-20T20:09:21.576Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: @module=sdk.framework tf_attribute_path=forbidden_account_ids tf_mux_provider=*proto5server.Server tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2023-06-20T20:09:21.576Z
2023-06-20T20:09:21.576Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 @module=sdk.framework tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 tf_rpc=PrepareProviderConfig tf_attribute_path=forbidden_account_ids tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2023-06-20T20:09:21.576Z
2023-06-20T20:09:21.576Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig tf_mux_provider=*proto5server.Server tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 timestamp=2023-06-20T20:09:21.576Z
2023-06-20T20:09:21.576Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: tf_mux_provider=*proto5server.Server tf_rpc=PrepareProviderConfig @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 timestamp=2023-06-20T20:09:21.576Z
2023-06-20T20:09:21.576Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 @module=sdk.framework tf_mux_provider=*proto5server.Server timestamp=2023-06-20T20:09:21.576Z
2023-06-20T20:09:21.576Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/aws tf_mux_provider=*proto5server.Server timestamp=2023-06-20T20:09:21.576Z
2023-06-20T20:09:21.576Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined validator.List: @module=sdk.framework description="list must contain at most 1 elements" tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:217 timestamp=2023-06-20T20:09:21.576Z
2023-06-20T20:09:21.577Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined validator.List: tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig description="list must contain at most 1 elements" tf_mux_provider=*proto5server.Server @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:227 @module=sdk.framework tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 timestamp=2023-06-20T20:09:21.576Z
2023-06-20T20:09:21.577Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 @module=sdk.framework tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig timestamp=2023-06-20T20:09:21.576Z
2023-06-20T20:09:21.577Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig @module=sdk.framework tf_mux_provider=*proto5server.Server tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 timestamp=2023-06-20T20:09:21.577Z
2023-06-20T20:09:21.577Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined validator.List: @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig description="list must contain at most 1 elements" tf_mux_provider=*proto5server.Server tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:217 timestamp=2023-06-20T20:09:21.577Z
2023-06-20T20:09:21.577Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined validator.List: tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:227 @module=sdk.framework description="list must contain at most 1 elements" tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 timestamp=2023-06-20T20:09:21.577Z
2023-06-20T20:09:21.577Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 @module=sdk.framework tf_mux_provider=*proto5server.Server timestamp=2023-06-20T20:09:21.577Z
2023-06-20T20:09:21.577Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 tf_mux_provider=*proto5server.Server tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2023-06-20T20:09:21.577Z
2023-06-20T20:09:21.577Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined validator.List: tf_rpc=PrepareProviderConfig @module=sdk.framework tf_mux_provider=*proto5server.Server tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:217 description="list must contain at most 1 elements" tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2023-06-20T20:09:21.577Z
2023-06-20T20:09:21.577Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined validator.List: tf_mux_provider=*proto5server.Server tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 tf_rpc=PrepareProviderConfig @module=sdk.framework description="list must contain at most 1 elements" tf_provider_addr=registry.terraform.io/hashicorp/aws @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:227 timestamp=2023-06-20T20:09:21.577Z
2023-06-20T20:09:21.577Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 tf_provider_addr=registry.terraform.io/hashicorp/aws @module=sdk.framework tf_mux_provider=*proto5server.Server tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 tf_rpc=PrepareProviderConfig timestamp=2023-06-20T20:09:21.577Z
2023-06-20T20:09:21.577Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 @module=sdk.framework tf_mux_provider=*proto5server.Server timestamp=2023-06-20T20:09:21.577Z
2023-06-20T20:09:21.577Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined validator.List: tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig description="list must contain at most 1 elements" tf_mux_provider=*proto5server.Server tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:217 @module=sdk.framework timestamp=2023-06-20T20:09:21.577Z
2023-06-20T20:09:21.577Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined validator.List: tf_mux_provider=*proto5server.Server tf_rpc=PrepareProviderConfig @module=sdk.framework description="list must contain at most 1 elements" tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=1536d0f8-522a-5a02-f850-2a3000ac7c30 @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:227 timestamp=2023-06-20T20:09:21.577Z
2023-06-20T20:09:21.580Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Configuring Terraform AWS Provider: tf_mux_provider=*schema.GRPCProviderServer tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=5aca117d-4258-17df-6443-50638f921b45 tf_rpc=ConfigureProvider @caller=github.com/hashicorp/terraform-provider-aws/internal/conns/config.go:141 @module=aws timestamp=2023-06-20T20:09:21.580Z
2023-06-20T20:09:21.580Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Resolving credentials provider: @module=aws.aws-base tf_req_id=5aca117d-4258-17df-6443-50638f921b45 @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:41 tf_mux_provider=*schema.GRPCProviderServer tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=ConfigureProvider timestamp=2023-06-20T20:09:21.580Z
2023-06-20T20:09:21.581Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Loading configuration: tf_mux_provider=*schema.GRPCProviderServer tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=5aca117d-4258-17df-6443-50638f921b45 tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:41 @module=aws.aws-base timestamp=2023-06-20T20:09:21.581Z
2023-06-20T20:09:21.581Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Retrieving credentials: tf_req_id=5aca117d-4258-17df-6443-50638f921b45 tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:41 @module=aws.aws-base tf_mux_provider=*schema.GRPCProviderServer tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2023-06-20T20:09:21.581Z
2023-06-20T20:09:21.581Z [INFO]  provider.terraform-provider-aws_v5.4.0_x5: Retrieved credentials: tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=5aca117d-4258-17df-6443-50638f921b45 @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:33 tf_mux_provider=*schema.GRPCProviderServer @module=aws.aws-base tf_aws.credentials_source=EnvConfigCredentials tf_rpc=ConfigureProvider timestamp=2023-06-20T20:09:21.581Z
2023-06-20T20:09:21.581Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Loading configuration: @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:41 tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=5aca117d-4258-17df-6443-50638f921b45 tf_rpc=ConfigureProvider @module=aws.aws-base tf_mux_provider=*schema.GRPCProviderServer timestamp=2023-06-20T20:09:21.581Z
2023-06-20T20:09:21.581Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Retrieving caller identity from STS: tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=5aca117d-4258-17df-6443-50638f921b45 tf_mux_provider=*schema.GRPCProviderServer tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:41 @module=aws.aws-base timestamp=2023-06-20T20:09:21.581Z
2023-06-20T20:09:21.582Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: HTTP Request Sent: tf_mux_provider=*schema.GRPCProviderServer tf_provider_addr=registry.terraform.io/hashicorp/aws http.method=POST http.request.header.amz_sdk_invocation_id=38091511-ac77-418e-8654-cd1590ffc387 http.request.header.amz_sdk_request="attempt=1; max=25" http.request.header.authorization="AWS4-HMAC-SHA256 Credential=AKIA************WPFS/20230620/us-east-1/sts/aws4_request, SignedHeaders=amz-sdk-invocation-id;amz-sdk-request;content-length;content-type;host;x-amz-date, Signature=*****" http.url=https://sts.us-east-1.amazonaws.com/ tf_rpc=ConfigureProvider http.request.body="Action=GetCallerIdentity&Version=2011-06-15
" http.request.header.x_amz_date=20230620T200921Z http.request_content_length=43 http.user_agent="APN/1.0 HashiCorp/1.0 Terraform/1.5.0 (+https://www.terraform.io) terraform-provider-aws/5.4.0 (+https://registry.terraform.io/providers/hashicorp/aws) aws-sdk-go-v2/1.18.1 os/linux lang/go/1.19.9 md/GOOS/linux md/GOARCH/amd64 api/sts/1.19.1" net.peer.name=sts.us-east-1.amazonaws.com tf_req_id=5aca117d-4258-17df-6443-50638f921b45 http.request.header.content_type=application/x-www-form-urlencoded @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:41 @module=aws.aws-base aws.operation=GetCallerIdentity aws.region=us-east-1 aws.sdk=aws-sdk-go-v2 aws.service=STS timestamp=2023-06-20T20:09:21.582Z
2023-06-20T20:09:21.600Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: HTTP Response Received: http.duration=17 tf_provider_addr=registry.terraform.io/hashicorp/aws @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:41 http.status_code=200 tf_mux_provider=*schema.GRPCProviderServer http.response.header.content_type=text/xml http.response.header.x_amzn_requestid=761b9923-7628-4191-9811-3aa799beb738 http.response_content_length=406 tf_req_id=5aca117d-4258-17df-6443-50638f921b45 tf_rpc=ConfigureProvider aws.region=us-east-1 aws.sdk=aws-sdk-go-v2 aws.service=STS http.response.body="<GetCallerIdentityResponse xmlns="https://sts.amazonaws.com/doc/2011-06-15/">
  <GetCallerIdentityResult>
    <Arn>arn:aws:iam::801210904757:user/terraform</Arn>
    <UserId>AIDA*************EC5P</UserId>
    <Account>801210904757</Account>
  </GetCallerIdentityResult>
  <ResponseMetadata>
    <RequestId>761b9923-7628-4191-9811-3aa799beb738</RequestId>
  </ResponseMetadata>
</GetCallerIdentityResponse>
" http.response.header.date="Tue, 20 Jun 2023 20:09:20 GMT" @module=aws.aws-base aws.operation=GetCallerIdentity timestamp=2023-06-20T20:09:21.600Z
2023-06-20T20:09:21.600Z [INFO]  provider.terraform-provider-aws_v5.4.0_x5: Retrieved caller identity from STS: tf_mux_provider=*schema.GRPCProviderServer tf_req_id=5aca117d-4258-17df-6443-50638f921b45 tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:33 @module=aws.aws-base tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2023-06-20T20:09:21.600Z
2023-06-20T20:09:21.600Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Creating AWS SDK v1 session: @caller=github.com/hashicorp/terraform-provider-aws/internal/conns/config.go:154 tf_req_id=5aca117d-4258-17df-6443-50638f921b45 tf_rpc=ConfigureProvider @module=aws tf_mux_provider=*schema.GRPCProviderServer tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2023-06-20T20:09:21.600Z
2023-06-20T20:09:21.600Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Retrieving AWS account details: @module=aws tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=ConfigureProvider tf_req_id=5aca117d-4258-17df-6443-50638f921b45 @caller=github.com/hashicorp/terraform-provider-aws/internal/conns/config.go:160 tf_mux_provider=*schema.GRPCProviderServer timestamp=2023-06-20T20:09:21.600Z
2023-06-20T20:09:21.600Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Retrieving caller identity from STS: @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:41 @module=aws.aws-base tf_mux_provider=*schema.GRPCProviderServer tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=ConfigureProvider tf_req_id=5aca117d-4258-17df-6443-50638f921b45 timestamp=2023-06-20T20:09:21.600Z
2023-06-20T20:09:21.601Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: HTTP Request Sent: aws.service=STS http.request.body="Action=GetCallerIdentity&Version=2011-06-15
" http.request.header.authorization="AWS4-HMAC-SHA256 Credential=AKIA************WPFS/20230620/us-east-1/sts/aws4_request, SignedHeaders=amz-sdk-invocation-id;amz-sdk-request;content-length;content-type;host;x-amz-date, Signature=*****" http.request.header.content_type=application/x-www-form-urlencoded net.peer.name=sts.us-east-1.amazonaws.com tf_rpc=ConfigureProvider aws.operation=GetCallerIdentity aws.region=us-east-1 http.request.header.amz_sdk_request="attempt=1; max=25" http.request.header.x_amz_date=20230620T200921Z http.request_content_length=43 tf_mux_provider=*schema.GRPCProviderServer @module=aws.aws-base aws.sdk=aws-sdk-go-v2 http.method=POST http.user_agent="APN/1.0 HashiCorp/1.0 Terraform/1.5.0 (+https://www.terraform.io) terraform-provider-aws/5.4.0 (+https://registry.terraform.io/providers/hashicorp/aws) aws-sdk-go-v2/1.18.1 os/linux lang/go/1.19.9 md/GOOS/linux md/GOARCH/amd64 api/sts/1.19.1" tf_provider_addr=registry.terraform.io/hashicorp/aws @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:41 http.url=https://sts.us-east-1.amazonaws.com/ tf_req_id=5aca117d-4258-17df-6443-50638f921b45 http.request.header.amz_sdk_invocation_id=93e518a9-ecd7-457a-b4c1-0b65588111d0 timestamp=2023-06-20T20:09:21.601Z
2023-06-20T20:09:21.603Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: HTTP Response Received: aws.region=us-east-1 http.response.body="<GetCallerIdentityResponse xmlns="https://sts.amazonaws.com/doc/2011-06-15/">
  <GetCallerIdentityResult>
    <Arn>arn:aws:iam::801210904757:user/terraform</Arn>
    <UserId>AIDA*************EC5P</UserId>
    <Account>801210904757</Account>
  </GetCallerIdentityResult>
  <ResponseMetadata>
    <RequestId>6a910a70-082b-456e-9c02-d8fb733ce0ac</RequestId>
  </ResponseMetadata>
</GetCallerIdentityResponse>
" http.response.header.content_type=text/xml http.response.header.date="Tue, 20 Jun 2023 20:09:20 GMT" @module=aws.aws-base aws.operation=GetCallerIdentity tf_rpc=ConfigureProvider tf_mux_provider=*schema.GRPCProviderServer tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=5aca117d-4258-17df-6443-50638f921b45 @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:41 http.response.header.x_amzn_requestid=6a910a70-082b-456e-9c02-d8fb733ce0ac http.response_content_length=406 http.status_code=200 aws.sdk=aws-sdk-go-v2 aws.service=STS http.duration=2 timestamp=2023-06-20T20:09:21.603Z
2023-06-20T20:09:21.603Z [INFO]  provider.terraform-provider-aws_v5.4.0_x5: Retrieved caller identity from STS: tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:33 @module=aws.aws-base tf_mux_provider=*schema.GRPCProviderServer tf_req_id=5aca117d-4258-17df-6443-50638f921b45 timestamp=2023-06-20T20:09:21.603Z
2023-06-20T20:09:21.616Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Provider Configure: tf_rpc=ConfigureProvider @module=sdk.framework tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/server_configureprovider.go:15 tf_req_id=5aca117d-4258-17df-6443-50638f921b45 timestamp=2023-06-20T20:09:21.616Z
2023-06-20T20:09:21.616Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Provider Configure: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/server_configureprovider.go:23 tf_mux_provider=*proto5server.Server tf_req_id=5aca117d-4258-17df-6443-50638f921b45 tf_rpc=ConfigureProvider @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2023-06-20T20:09:21.616Z
2023-06-20T20:09:21.617Z [DEBUG] Resource instance state not found for node "module.ec2.aws_instance.ec2_instance", instance module.ec2.aws_instance.ec2_instance
2023-06-20T20:09:21.617Z [INFO]  ReferenceTransformer: reference not found: "var.ami_id"
2023-06-20T20:09:21.617Z [INFO]  ReferenceTransformer: reference not found: "var.instance_type"
2023-06-20T20:09:21.617Z [INFO]  ReferenceTransformer: reference not found: "var.subnet_id"
2023-06-20T20:09:21.617Z [DEBUG] ReferenceTransformer: "module.ec2.aws_instance.ec2_instance" references: []
2023-06-20T20:09:21.617Z [DEBUG] Resource instance state not found for node "module.ec2.aws_launch_configuration.launch_config", instance module.ec2.aws_launch_configuration.launch_config
2023-06-20T20:09:21.617Z [INFO]  ReferenceTransformer: reference not found: "var.ami_id"
2023-06-20T20:09:21.617Z [INFO]  ReferenceTransformer: reference not found: "var.instance_type"
2023-06-20T20:09:21.618Z [DEBUG] ReferenceTransformer: "module.ec2.aws_launch_configuration.launch_config" references: []
2023-06-20T20:09:21.618Z [DEBUG] refresh: module.ec2.aws_instance.ec2_instance: no state, so not refreshing
2023-06-20T20:09:21.618Z [DEBUG] refresh: module.ec2.aws_launch_configuration.launch_config: no state, so not refreshing
2023-06-20T20:09:21.622Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.ec2.aws_launch_configuration.launch_config, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .enable_monitoring: planned value cty.True for a non-computed attribute
      - .ebs_block_device: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .metadata_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .root_block_device: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2023-06-20T20:09:21.622Z [DEBUG] Resource instance state not found for node "module.ec2.aws_autoscaling_group.autoscaling_group", instance module.ec2.aws_autoscaling_group.autoscaling_group
2023-06-20T20:09:21.622Z [INFO]  ReferenceTransformer: reference not found: "var.desired_capacity"
2023-06-20T20:09:21.622Z [INFO]  ReferenceTransformer: reference not found: "var.max_size"
2023-06-20T20:09:21.622Z [INFO]  ReferenceTransformer: reference not found: "var.min_size"
2023-06-20T20:09:21.622Z [INFO]  ReferenceTransformer: reference not found: "var.subnet_id"
2023-06-20T20:09:21.622Z [DEBUG] ReferenceTransformer: "module.ec2.aws_autoscaling_group.autoscaling_group" references: []
2023-06-20T20:09:21.622Z [DEBUG] refresh: module.ec2.aws_autoscaling_group.autoscaling_group: no state, so not refreshing
2023-06-20T20:09:21.626Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.ec2.aws_instance.ec2_instance, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .get_password_data: planned value cty.False for a non-computed attribute
      - .source_dest_check: planned value cty.True for a non-computed attribute
      - .user_data_replace_on_change: planned value cty.False for a non-computed attribute
      - .enclave_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .instance_market_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .private_dns_name_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .metadata_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .cpu_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .ebs_block_device: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .maintenance_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .capacity_reservation_specification: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .ephemeral_block_device: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .network_interface: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .root_block_device: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2023-06-20T20:09:21.633Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.ec2.aws_autoscaling_group.autoscaling_group, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .force_delete: planned value cty.False for a non-computed attribute
      - .force_delete_warm_pool: planned value cty.False for a non-computed attribute
      - .health_check_grace_period: planned value cty.NumberIntVal(300) for a non-computed attribute
      - .wait_for_capacity_timeout: planned value cty.StringVal("10m") for a non-computed attribute
      - .metrics_granularity: planned value cty.StringVal("1Minute") for a non-computed attribute
      - .protect_from_scale_in: planned value cty.False for a non-computed attribute
      - .traffic_source: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2023-06-20T20:09:21.634Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-06-20T20:09:21.635Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5 pid=108
2023-06-20T20:09:21.635Z [DEBUG] provider: plugin exited
2023-06-20T20:09:21.636Z [DEBUG] created provider logger: level=debug
2023-06-20T20:09:21.636Z [INFO]  provider: configuring client automatic mTLS
2023-06-20T20:09:21.648Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/null/3.2.1/linux_amd64/terraform-provider-null_v3.2.1_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/null/3.2.1/linux_amd64/terraform-provider-null_v3.2.1_x5]
2023-06-20T20:09:21.651Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/null/3.2.1/linux_amd64/terraform-provider-null_v3.2.1_x5 pid=130
2023-06-20T20:09:21.651Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/null/3.2.1/linux_amd64/terraform-provider-null_v3.2.1_x5
2023-06-20T20:09:21.663Z [INFO]  provider.terraform-provider-null_v3.2.1_x5: configuring server automatic mTLS: timestamp=2023-06-20T20:09:21.663Z
2023-06-20T20:09:21.683Z [DEBUG] provider.terraform-provider-null_v3.2.1_x5: plugin address: address=/tmp/plugin1773892020 network=unix timestamp=2023-06-20T20:09:21.683Z
2023-06-20T20:09:21.683Z [DEBUG] provider: using plugin: version=5
2023-06-20T20:09:21.706Z [DEBUG] provider.terraform-provider-null_v3.2.1_x5: Calling provider defined Provider Metadata: @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/null tf_req_id=7063eff7-3a8c-726a-ae18-2a8730713f56 tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v0.16.0/internal/fwserver/server_getproviderschema.go:39 timestamp=2023-06-20T20:09:21.706Z
2023-06-20T20:09:21.706Z [DEBUG] provider.terraform-provider-null_v3.2.1_x5: Called provider defined Provider Metadata: tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v0.16.0/internal/fwserver/server_getproviderschema.go:41 @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/null tf_req_id=7063eff7-3a8c-726a-ae18-2a8730713f56 timestamp=2023-06-20T20:09:21.706Z
2023-06-20T20:09:21.706Z [DEBUG] provider.terraform-provider-null_v3.2.1_x5: Calling provider defined Provider GetSchema: @caller=github.com/hashicorp/terraform-plugin-framework@v0.16.0/internal/fwserver/server.go:260 @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/null tf_req_id=7063eff7-3a8c-726a-ae18-2a8730713f56 tf_rpc=GetProviderSchema timestamp=2023-06-20T20:09:21.706Z
2023-06-20T20:09:21.707Z [DEBUG] provider.terraform-provider-null_v3.2.1_x5: Called provider defined Provider GetSchema: @caller=github.com/hashicorp/terraform-plugin-framework@v0.16.0/internal/fwserver/server.go:262 @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/null tf_req_id=7063eff7-3a8c-726a-ae18-2a8730713f56 tf_rpc=GetProviderSchema timestamp=2023-06-20T20:09:21.706Z
2023-06-20T20:09:21.707Z [DEBUG] provider.terraform-provider-null_v3.2.1_x5: Calling provider defined Provider Resources: @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/null tf_req_id=7063eff7-3a8c-726a-ae18-2a8730713f56 tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v0.16.0/internal/fwserver/server.go:330 timestamp=2023-06-20T20:09:21.707Z
2023-06-20T20:09:21.707Z [DEBUG] provider.terraform-provider-null_v3.2.1_x5: Called provider defined Provider Resources: tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v0.16.0/internal/fwserver/server.go:332 @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/null tf_req_id=7063eff7-3a8c-726a-ae18-2a8730713f56 timestamp=2023-06-20T20:09:21.707Z
2023-06-20T20:09:21.707Z [DEBUG] provider.terraform-provider-null_v3.2.1_x5: Calling provider defined Resource GetSchema: tf_resource_type=null_resource @caller=github.com/hashicorp/terraform-plugin-framework@v0.16.0/internal/fwserver/server.go:411 @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/null tf_req_id=7063eff7-3a8c-726a-ae18-2a8730713f56 tf_rpc=GetProviderSchema timestamp=2023-06-20T20:09:21.707Z
2023-06-20T20:09:21.707Z [DEBUG] provider.terraform-provider-null_v3.2.1_x5: Called provider defined Resource GetSchema: tf_provider_addr=registry.terraform.io/hashicorp/null tf_req_id=7063eff7-3a8c-726a-ae18-2a8730713f56 tf_resource_type=null_resource tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v0.16.0/internal/fwserver/server.go:413 @module=sdk.framework timestamp=2023-06-20T20:09:21.707Z
2023-06-20T20:09:21.707Z [DEBUG] provider.terraform-provider-null_v3.2.1_x5: Calling provider defined Provider DataSources: @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/null tf_req_id=7063eff7-3a8c-726a-ae18-2a8730713f56 tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v0.16.0/internal/fwserver/server.go:152 timestamp=2023-06-20T20:09:21.707Z
2023-06-20T20:09:21.707Z [DEBUG] provider.terraform-provider-null_v3.2.1_x5: Called provider defined Provider DataSources: @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/null tf_req_id=7063eff7-3a8c-726a-ae18-2a8730713f56 tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v0.16.0/internal/fwserver/server.go:154 timestamp=2023-06-20T20:09:21.707Z
2023-06-20T20:09:21.707Z [DEBUG] provider.terraform-provider-null_v3.2.1_x5: Calling provider defined DataSource GetSchema: tf_provider_addr=registry.terraform.io/hashicorp/null tf_req_id=7063eff7-3a8c-726a-ae18-2a8730713f56 @caller=github.com/hashicorp/terraform-plugin-framework@v0.16.0/internal/fwserver/server.go:233 @module=sdk.framework tf_data_source_type=null_data_source tf_rpc=GetProviderSchema timestamp=2023-06-20T20:09:21.707Z
2023-06-20T20:09:21.707Z [DEBUG] provider.terraform-provider-null_v3.2.1_x5: Called provider defined DataSource GetSchema: @module=sdk.framework tf_data_source_type=null_data_source @caller=github.com/hashicorp/terraform-plugin-framework@v0.16.0/internal/fwserver/server.go:235 tf_provider_addr=registry.terraform.io/hashicorp/null tf_req_id=7063eff7-3a8c-726a-ae18-2a8730713f56 tf_rpc=GetProviderSchema timestamp=2023-06-20T20:09:21.707Z
2023-06-20T20:09:21.708Z [DEBUG] No provider meta schema returned
2023-06-20T20:09:21.708Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-06-20T20:09:21.709Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/null/3.2.1/linux_amd64/terraform-provider-null_v3.2.1_x5 pid=130
2023-06-20T20:09:21.709Z [DEBUG] provider: plugin exited
2023-06-20T20:09:21.709Z [DEBUG] created provider logger: level=debug
2023-06-20T20:09:21.710Z [INFO]  provider: configuring client automatic mTLS
2023-06-20T20:09:21.721Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.5.1/linux_amd64/terraform-provider-random_v3.5.1_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/random/3.5.1/linux_amd64/terraform-provider-random_v3.5.1_x5]
2023-06-20T20:09:21.723Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.5.1/linux_amd64/terraform-provider-random_v3.5.1_x5 pid=138
2023-06-20T20:09:21.723Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.5.1/linux_amd64/terraform-provider-random_v3.5.1_x5
2023-06-20T20:09:21.734Z [INFO]  provider.terraform-provider-random_v3.5.1_x5: configuring server automatic mTLS: timestamp=2023-06-20T20:09:21.734Z
2023-06-20T20:09:21.752Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: plugin address: network=unix address=/tmp/plugin3050192799 timestamp=2023-06-20T20:09:21.752Z
2023-06-20T20:09:21.753Z [DEBUG] provider: using plugin: version=5
2023-06-20T20:09:21.770Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Calling provider defined Provider Metadata: tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=d116a5ba-d6ca-e253-ab29-340e8fefc11a tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server_getproviderschema.go:36 @module=sdk.framework timestamp=2023-06-20T20:09:21.770Z
2023-06-20T20:09:21.770Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Called provider defined Provider Metadata: tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=d116a5ba-d6ca-e253-ab29-340e8fefc11a tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server_getproviderschema.go:38 @module=sdk.framework timestamp=2023-06-20T20:09:21.770Z
2023-06-20T20:09:21.770Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Calling provider defined Provider Schema: @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=d116a5ba-d6ca-e253-ab29-340e8fefc11a tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:272 timestamp=2023-06-20T20:09:21.770Z
2023-06-20T20:09:21.770Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Called provider defined Provider Schema: @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=d116a5ba-d6ca-e253-ab29-340e8fefc11a tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:274 timestamp=2023-06-20T20:09:21.770Z
2023-06-20T20:09:21.770Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Calling provider defined Provider Resources: tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=d116a5ba-d6ca-e253-ab29-340e8fefc11a tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:349 @module=sdk.framework timestamp=2023-06-20T20:09:21.770Z
2023-06-20T20:09:21.770Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Called provider defined Provider Resources: @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:351 @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=d116a5ba-d6ca-e253-ab29-340e8fefc11a tf_rpc=GetProviderSchema timestamp=2023-06-20T20:09:21.770Z
2023-06-20T20:09:21.771Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Calling provider defined Resource Schema: tf_req_id=d116a5ba-d6ca-e253-ab29-340e8fefc11a tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:433 @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/random tf_resource_type=random_id timestamp=2023-06-20T20:09:21.770Z
2023-06-20T20:09:21.771Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Called provider defined Resource Schema: @module=sdk.framework tf_req_id=d116a5ba-d6ca-e253-ab29-340e8fefc11a tf_rpc=GetProviderSchema tf_provider_addr=registry.terraform.io/hashicorp/random tf_resource_type=random_id @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:435 timestamp=2023-06-20T20:09:21.770Z
2023-06-20T20:09:21.771Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Calling provider defined Resource Schema: tf_resource_type=random_integer tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:433 tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=d116a5ba-d6ca-e253-ab29-340e8fefc11a @module=sdk.framework timestamp=2023-06-20T20:09:21.771Z
2023-06-20T20:09:21.771Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Called provider defined Resource Schema: @module=sdk.framework tf_resource_type=random_integer tf_rpc=GetProviderSchema tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=d116a5ba-d6ca-e253-ab29-340e8fefc11a @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:435 timestamp=2023-06-20T20:09:21.771Z
2023-06-20T20:09:21.771Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Calling provider defined Resource Schema: @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:433 tf_resource_type=random_password tf_rpc=GetProviderSchema @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=d116a5ba-d6ca-e253-ab29-340e8fefc11a timestamp=2023-06-20T20:09:21.771Z
2023-06-20T20:09:21.771Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Called provider defined Resource Schema: tf_resource_type=random_password tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:435 @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=d116a5ba-d6ca-e253-ab29-340e8fefc11a timestamp=2023-06-20T20:09:21.771Z
2023-06-20T20:09:21.771Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Calling provider defined Resource Schema: @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:433 @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=d116a5ba-d6ca-e253-ab29-340e8fefc11a tf_resource_type=random_pet tf_rpc=GetProviderSchema timestamp=2023-06-20T20:09:21.771Z
2023-06-20T20:09:21.771Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Called provider defined Resource Schema: @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:435 @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=d116a5ba-d6ca-e253-ab29-340e8fefc11a tf_resource_type=random_pet tf_rpc=GetProviderSchema timestamp=2023-06-20T20:09:21.771Z
2023-06-20T20:09:21.771Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Calling provider defined Resource Schema: tf_provider_addr=registry.terraform.io/hashicorp/random @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:433 @module=sdk.framework tf_req_id=d116a5ba-d6ca-e253-ab29-340e8fefc11a tf_resource_type=random_shuffle tf_rpc=GetProviderSchema timestamp=2023-06-20T20:09:21.771Z
2023-06-20T20:09:21.771Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Called provider defined Resource Schema: tf_req_id=d116a5ba-d6ca-e253-ab29-340e8fefc11a tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:435 @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/random tf_resource_type=random_shuffle timestamp=2023-06-20T20:09:21.771Z
2023-06-20T20:09:21.771Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Calling provider defined Resource Schema: tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=d116a5ba-d6ca-e253-ab29-340e8fefc11a tf_resource_type=random_string @module=sdk.framework tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:433 timestamp=2023-06-20T20:09:21.771Z
2023-06-20T20:09:21.771Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Called provider defined Resource Schema: tf_req_id=d116a5ba-d6ca-e253-ab29-340e8fefc11a tf_resource_type=random_string tf_rpc=GetProviderSchema @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/random @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:435 timestamp=2023-06-20T20:09:21.771Z
2023-06-20T20:09:21.771Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Calling provider defined Resource Schema: @module=sdk.framework tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:433 tf_req_id=d116a5ba-d6ca-e253-ab29-340e8fefc11a tf_resource_type=random_uuid tf_provider_addr=registry.terraform.io/hashicorp/random timestamp=2023-06-20T20:09:21.771Z
2023-06-20T20:09:21.771Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Called provider defined Resource Schema: @module=sdk.framework tf_resource_type=random_uuid tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:435 tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=d116a5ba-d6ca-e253-ab29-340e8fefc11a timestamp=2023-06-20T20:09:21.771Z
2023-06-20T20:09:21.771Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Calling provider defined Provider DataSources: @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=d116a5ba-d6ca-e253-ab29-340e8fefc11a tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:152 timestamp=2023-06-20T20:09:21.771Z
2023-06-20T20:09:21.771Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Called provider defined Provider DataSources: tf_req_id=d116a5ba-d6ca-e253-ab29-340e8fefc11a tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:154 @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/random timestamp=2023-06-20T20:09:21.771Z
2023-06-20T20:09:21.772Z [DEBUG] No provider meta schema returned
2023-06-20T20:09:21.773Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-06-20T20:09:21.774Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.5.1/linux_amd64/terraform-provider-random_v3.5.1_x5 pid=138
2023-06-20T20:09:21.774Z [DEBUG] provider: plugin exited
2023-06-20T20:09:21.774Z [DEBUG] building apply graph to check for errors
2023-06-20T20:09:21.774Z [DEBUG] Resource state not found for node "module.ec2.aws_instance.ec2_instance", instance module.ec2.aws_instance.ec2_instance
2023-06-20T20:09:21.774Z [DEBUG] Resource state not found for node "module.ec2.aws_launch_configuration.launch_config", instance module.ec2.aws_launch_configuration.launch_config
2023-06-20T20:09:21.775Z [DEBUG] Resource state not found for node "module.ec2.aws_autoscaling_group.autoscaling_group", instance module.ec2.aws_autoscaling_group.autoscaling_group
2023-06-20T20:09:21.775Z [DEBUG] ProviderTransformer: "module.ec2.aws_instance.ec2_instance (expand)" (*terraform.nodeExpandApplyableResource) needs module.ec2.provider["registry.terraform.io/hashicorp/aws"]
2023-06-20T20:09:21.775Z [DEBUG] ProviderTransformer: "module.ec2.aws_instance.ec2_instance" (*terraform.NodeApplyableResourceInstance) needs module.ec2.provider["registry.terraform.io/hashicorp/aws"]
2023-06-20T20:09:21.775Z [DEBUG] ProviderTransformer: "module.ec2.aws_launch_configuration.launch_config" (*terraform.NodeApplyableResourceInstance) needs module.ec2.provider["registry.terraform.io/hashicorp/aws"]
2023-06-20T20:09:21.775Z [DEBUG] ProviderTransformer: "module.ec2.aws_launch_configuration.launch_config (expand)" (*terraform.nodeExpandApplyableResource) needs module.ec2.provider["registry.terraform.io/hashicorp/aws"]
2023-06-20T20:09:21.775Z [DEBUG] ProviderTransformer: "module.ec2.aws_autoscaling_group.autoscaling_group (expand)" (*terraform.nodeExpandApplyableResource) needs module.ec2.provider["registry.terraform.io/hashicorp/aws"]
2023-06-20T20:09:21.775Z [DEBUG] ProviderTransformer: "module.ec2.aws_autoscaling_group.autoscaling_group" (*terraform.NodeApplyableResourceInstance) needs module.ec2.provider["registry.terraform.io/hashicorp/aws"]
2023-06-20T20:09:21.775Z [DEBUG] pruning unused provider["registry.terraform.io/hashicorp/random"]
2023-06-20T20:09:21.775Z [DEBUG] pruning unused provider["registry.terraform.io/hashicorp/null"]
2023-06-20T20:09:21.775Z [DEBUG] pruning unused provider["registry.terraform.io/hashicorp/aws"]
2023-06-20T20:09:21.775Z [DEBUG] ReferenceTransformer: "module.ec2 (expand)" references: []
2023-06-20T20:09:21.775Z [DEBUG] ReferenceTransformer: "module.ec2.aws_instance.ec2_instance (expand)" references: []
2023-06-20T20:09:21.775Z [DEBUG] ReferenceTransformer: "module.ec2.var.subnet_id (expand)" references: []
2023-06-20T20:09:21.776Z [DEBUG] ReferenceTransformer: "module.ec2.var.max_size (expand)" references: []
2023-06-20T20:09:21.776Z [DEBUG] ReferenceTransformer: "module.ec2.aws_instance.ec2_instance" references: [module.ec2.var.instance_type (expand) module.ec2.var.subnet_id (expand) module.ec2.var.ami_id (expand)]
2023-06-20T20:09:21.776Z [DEBUG] ReferenceTransformer: "module.ec2.var.aws_region (expand)" references: []
2023-06-20T20:09:21.776Z [DEBUG] ReferenceTransformer: "module.ec2.var.ami_id (expand)" references: []
2023-06-20T20:09:21.776Z [DEBUG] ReferenceTransformer: "module.ec2.aws_launch_configuration.launch_config" references: [module.ec2.var.instance_type (expand) module.ec2.var.ami_id (expand)]
2023-06-20T20:09:21.776Z [DEBUG] ReferenceTransformer: "module.ec2.aws_launch_configuration.launch_config (expand)" references: []
2023-06-20T20:09:21.776Z [DEBUG] ReferenceTransformer: "module.ec2.aws_autoscaling_group.autoscaling_group (expand)" references: []
2023-06-20T20:09:21.776Z [DEBUG] ReferenceTransformer: "module.ec2.var.desired_capacity (expand)" references: []
2023-06-20T20:09:21.776Z [DEBUG] ReferenceTransformer: "module.ec2 (close)" references: []
2023-06-20T20:09:21.776Z [DEBUG] ReferenceTransformer: "module.ec2.var.instance_type (expand)" references: []
2023-06-20T20:09:21.776Z [DEBUG] ReferenceTransformer: "module.ec2.var.min_size (expand)" references: []
2023-06-20T20:09:21.776Z [DEBUG] ReferenceTransformer: "module.ec2.aws_autoscaling_group.autoscaling_group" references: [module.ec2.var.min_size (expand) module.ec2.var.subnet_id (expand) module.ec2.aws_launch_configuration.launch_config module.ec2.aws_launch_configuration.launch_config module.ec2.aws_launch_configuration.launch_config (expand) module.ec2.var.desired_capacity (expand) module.ec2.var.max_size (expand)]
2023-06-20T20:09:21.776Z [DEBUG] ReferenceTransformer: "module.ec2.provider[\"registry.terraform.io/hashicorp/aws\"]" references: [module.ec2.var.aws_region (expand)]
2023-06-20T20:09:21.777Z [INFO]  backend/local: plan operation completed
2023-06-20T20:09:21.777Z [INFO]  backend/local: writing plan output to: /home/tfc-agent/.tfc-agent/component/terraform/runs/run-WgP8yr6W7rEJyHkf/config/terraform.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ec2.aws_autoscaling_group.autoscaling_group will be created
  + resource "aws_autoscaling_group" "autoscaling_group" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 2
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + launch_configuration      = "example-launch-config"
      + load_balancers            = (known after apply)
      + max_size                  = 3
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = "example-autoscaling-group"
      + name_prefix               = (known after apply)
      + predicted_capacity        = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-9fc9dea1",
        ]
      + wait_for_capacity_timeout = "10m"
      + warm_pool_size            = (known after apply)
    }

  # module.ec2.aws_instance.ec2_instance will be created
  + resource "aws_instance" "ec2_instance" {
      + ami                                  = "ami-022e1a32d3f742bd8"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-9fc9dea1"
      + tags                                 = {
          + "Name" = "EC2Instance"
        }
      + tags_all                             = {
          + "Name" = "EC2Instance"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # module.ec2.aws_launch_configuration.launch_config will be created
  + resource "aws_launch_configuration" "launch_config" {
      + arn                         = (known after apply)
      + associate_public_ip_address = (known after apply)
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + id                          = (known after apply)
      + image_id                    = "ami-022e1a32d3f742bd8"
      + instance_type               = "t2.micro"
      + key_name                    = (known after apply)
      + name                        = "example-launch-config"
      + name_prefix                 = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 2 of 2 estimated
           $33.408/mo +$33.408
```
</details>
*Pusher: @malliparitala, Action: `pull_request`*